---
kind: property
id: P:Autodesk.Revit.DB.Rectangle.Left
source: html/c371a8fa-de5f-7d68-4cae-6dee77090bc1.htm
---
# Autodesk.Revit.DB.Rectangle.Left Property

The x-coordinate of the top-left corner of the rectangle.

## Syntax (C#)
```csharp
public int Left { get; set; }
```